Revit 2025 API
StructuralSectionErrorCode Enumeration
 Error codes for StructuralSection related operations.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StructuralSectionErrorCode
Public Enumeration StructuralSectionErrorCode
public enum class StructuralSectionErrorCode
type StructuralSectionErrorCode
Members
Member name | Value | Description
Success | 0
Failure | 1
ShapeNotRecognized | 2
IncompleteDefinition | 3
ElementNotSupported | 4
MediumDetailShapeHasRounding | 5
MediumAndFineDetailShapesAreInconsistent | 6
ElementHasIndependentJustification | 7
See Also
Reference
Autodesk.Revit.DB.Structure.StructuralSections Namespace